## Data Cleaning

In [1]:
# Import modules
import pandas as pd
from ast import literal_eval

### TMDB Data

In [99]:
# Load dataset
tmdb_df = pd.read_csv('../acquisition/tmdb_raw_data.csv')

In [100]:
tmdb_df.head()

,adult,backdrop_path,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,vote_average,vote_count,belongs_to_collection.id,belongs_to_collection.name,belongs_to_collection.poster_path,belongs_to_collection.backdrop_path,belongs_to_collection,success,status_code,status_message
0,False,/3Rfvhy1Nl6sSGJwyjb0QiZzZYlB.jpg,30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,7.965,16207,10194.0,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,NaN,NaN,NaN,NaN
1,False,/pYw10zrqfkdm3yD9JTO6vEGQhKy.jpg,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",http://www.sonypictures.com/movies/jumanji/,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,7.200,9368,495527.0,Jumanji Collection,/6sjMsBcIuqU44GpG5tL33KUFOQR.jpg,/9PCsWrw1GvrZkrd1GCxRqscgZu0.jpg,NaN,NaN,NaN,NaN
2,False,/1J4Z7VhdAgtdd97nCxY7dcBpjGT.jpg,25000000,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,6.441,316,119050.0,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,NaN,NaN,NaN,NaN
3,False,/jZjoEKXMTDoZAGdkjhAdJaKtXSN.jpg,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,6.300,128,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,False,/lEsjVrGU21BeJjF5AF9EWsihDpw.jpg,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,6.228,621,96871.0,Father of the Bride (Steve Martin) Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,NaN,NaN,NaN,NaN

In [101]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9626 entries, 0 to 9625
Data columns (total 32 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   adult                                9626 non-null   bool
 1   backdrop_path                        9371 non-null   object
 2   budget                               9626 non-null   int64
 3   genres                               9626 non-null   object
 4   homepage                             2516 non-null   object
 5   id                                   9626 non-null   int64
 6   imdb_id                              9626 non-null   object
 7   original_language                    9626 non-null   object
 8   original_title                       9626 non-null   object
 9   overview                             9616 non-null   object
 10  popularity                           9626 non-null   float64
 11  poster_path                          9606 non-null   object
 12  production_companies                 9626 non-null   object
 13  production_countries                 9626 non-null   object
 14  release_date                         9626 non-null   object
 15  revenue                              9626 non-null   int64
 16  runtime                              9626 non-null   int64
 17  spoken_languages                     9626 non-null   object
 18  status                               9626 non-null   object
 19  tagline                              7911 non-null   object
 20  title                                9626 non-null   object
 21  video                                9626 non-null   bool
 22  vote_average                         9626 non-null   float64
 23  vote_count                           9626 non-null   int64
 24  belongs_to_collection.id             2044 non-null   float64
 25  belongs_to_collection.name           2044 non-null   object
 26  belongs_to_collection.poster_path    1994 non-null   object
 27  belongs_to_collection.backdrop_path  1830 non-null   object
 28  belongs_to_collection                0 non-null      float64
 29  success                              0 non-null      float64
 30  status_code                          0 non-null      float64
 31  status_message                       0 non-null      float64
dtypes: bool(2), float64(7), int64(5), object(18)
memory usage: 2.2+ MB

In [102]:
# only taking the columns needed
tmdb_df = tmdb_df[['original_title','imdb_id','genres','release_date','revenue','runtime','vote_average','original_language']]

In [103]:
tmdb_df.head()

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average,original_language
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,en
1,Jumanji,tt0113497,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",1995-12-15,262821940,104,7.200,en
2,Grumpier Old Men,tt0113228,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",1995-12-22,71500000,101,6.441,en
3,Waiting to Exhale,tt0114885,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",1995-12-22,81452156,127,6.300,en
4,Father of the Bride Part II,tt0113041,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",1995-12-08,76594107,106,6.228,en

In [104]:
# converting the genres column to be a string from a list so that it can be exploded
tmdb_df['genres'] = tmdb_df['genres'].apply(literal_eval)

In [105]:
tmdb_df.head()

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average,original_language
0,Toy Story,tt0114709,"[{'id': 16, 'name': 'Animation'}, {'id': 12, '...",1995-10-30,373554033,81,7.965,en
1,Jumanji,tt0113497,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",1995-12-15,262821940,104,7.200,en
2,Grumpier Old Men,tt0113228,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",1995-12-22,71500000,101,6.441,en
3,Waiting to Exhale,tt0114885,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",1995-12-22,81452156,127,6.300,en
4,Father of the Bride Part II,tt0113041,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",1995-12-08,76594107,106,6.228,en

In [106]:
genres_only = tmdb_df.explode('genres')

In [107]:
genres_only.head()

,original_title,imdb_id,genres,release_date,revenue,runtime,vote_average,original_language
0,Toy Story,tt0114709,"{'id': 16, 'name': 'Animation'}",1995-10-30,373554033,81,7.965,en
0,Toy Story,tt0114709,"{'id': 12, 'name': 'Adventure'}",1995-10-30,373554033,81,7.965,en
0,Toy Story,tt0114709,"{'id': 10751, 'name': 'Family'}",1995-10-30,373554033,81,7.965,en
0,Toy Story,tt0114709,"{'id': 35, 'name': 'Comedy'}",1995-10-30,373554033,81,7.965,en
1,Jumanji,tt0113497,"{'id': 12, 'name': 'Adventure'}",1995-12-15,262821940,104,7.200,en

In [108]:
# retrieving genres from the 'genres' dict
genres_only = genres_only['genres'].apply(pd.Series)

In [109]:
genres_only.head(10)

        id       name   0
0     16.0  Animation NaN
0     12.0  Adventure NaN
0  10751.0     Family NaN
0     35.0     Comedy NaN
1     12.0  Adventure NaN
1     14.0    Fantasy NaN
1  10751.0     Family NaN
2  10749.0    Romance NaN
2     35.0     Comedy NaN
3     35.0     Comedy NaN

In [110]:
# merging with main df to get values for merging later
genres_only = pd.merge(tmdb_df, genres_only, left_index=True, right_index=True)

In [111]:
genres_only = genres_only[['original_title','imdb_id','name']]
genres_only.rename(columns={'name':'genre'}, inplace=True)

In [112]:
genres_only.head(10)

      original_title    imdb_id      genre
0          Toy Story  tt0114709  Animation
0          Toy Story  tt0114709  Adventure
0          Toy Story  tt0114709     Family
0          Toy Story  tt0114709     Comedy
1            Jumanji  tt0113497  Adventure
1            Jumanji  tt0113497    Fantasy
1            Jumanji  tt0113497     Family
2   Grumpier Old Men  tt0113228    Romance
2   Grumpier Old Men  tt0113228     Comedy
3  Waiting to Exhale  tt0114885     Comedy

In [113]:
# bringing genres back to a single row
genres_only = genres_only['genre'].groupby([genres_only['original_title'],genres_only['imdb_id']]).apply(list).reset_index()

In [114]:
genres_only.head()

,original_title,imdb_id,genre
0,'71,tt2614684,"[Thriller, Action, Drama, War]"
1,'Tis the Season for Love,tt5056034,"[Romance, TV Movie]"
2,"'night, Mother",tt0090556,[Drama]
3,(500) Days of Summer,tt1022603,"[Comedy, Drama, Romance]"
4,*batteries not included,tt0092494,"[Science Fiction, Comedy, Family, Fantasy]"

In [115]:
# splitting genres into their own columns
genres_merging = pd.DataFrame([pd.Series(x) for x in genres_only['genre']])
genres_merging.columns = ['genre_{}'.format(x+1) for x in genres_merging.columns]

In [116]:
genres_merging

,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10
0,Thriller,Action,Drama,War,NaN,NaN,NaN,NaN,NaN,NaN
1,Romance,TV Movie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Comedy,Drama,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Science Fiction,Comedy,Family,Fantasy,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
9620,Action,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9621,Action,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9622,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9623,Drama,Thriller,Crime,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9624,Action,Crime,Mystery,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [117]:
# bringing genre dataframes together to merge back to our main df
genres_merging = pd.concat([genres_only, genres_merging], axis=1)

In [118]:
genres_merging.head(10)

,original_title,imdb_id,genre,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10
0,'71,tt2614684,"[Thriller, Action, Drama, War]",Thriller,Action,Drama,War,NaN,NaN,NaN,NaN,NaN,NaN
1,'Tis the Season for Love,tt5056034,"[Romance, TV Movie]",Romance,TV Movie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"'night, Mother",tt0090556,[Drama],Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,(500) Days of Summer,tt1022603,"[Comedy, Drama, Romance]",Comedy,Drama,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,*batteries not included,tt0092494,"[Science Fiction, Comedy, Family, Fantasy]",Science Fiction,Comedy,Family,Fantasy,NaN,NaN,NaN,NaN,NaN,NaN
5,...All the Marbles,tt0081964,"[Comedy, Drama]",Comedy,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,...And Justice for All,tt0078718,"[Crime, Drama, Thriller]",Crime,Drama,Thriller,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,00 Schneider - Jagd auf Nihil Baxter,tt0109000,"[Comedy, Crime]",Comedy,Crime,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,10,tt0078721,"[Comedy, Romance]",Comedy,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10 Cent Pistol,tt2134170,"[Action, Crime, Thriller]",Action,Crime,Thriller,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [119]:
# merging genres into original df
tmdb_df = pd.merge(tmdb_df, genres_merging, left_on=['imdb_id','original_title'], right_on=['imdb_id','original_title'])

In [120]:
tmdb_df.drop(columns=['genre','genres'], inplace=True)

In [121]:
tmdb_df.head()

,original_title,imdb_id,release_date,revenue,runtime,vote_average,original_language,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10
0,Toy Story,tt0114709,1995-10-30,373554033,81,7.965,en,Animation,Adventure,Family,Comedy,NaN,NaN,NaN,NaN,NaN,NaN
1,Jumanji,tt0113497,1995-12-15,262821940,104,7.200,en,Adventure,Fantasy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Grumpier Old Men,tt0113228,1995-12-22,71500000,101,6.441,en,Romance,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Waiting to Exhale,tt0114885,1995-12-22,81452156,127,6.300,en,Comedy,Drama,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Father of the Bride Part II,tt0113041,1995-12-08,76594107,106,6.228,en,Comedy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [122]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_title     9626 non-null   object
 1   imdb_id            9626 non-null   object
 2   release_date       9626 non-null   object
 3   revenue            9626 non-null   int64
 4   runtime            9626 non-null   int64
 5   vote_average       9626 non-null   float64
 6   original_language  9626 non-null   object
 7   genre_1            9622 non-null   object
 8   genre_2            7923 non-null   object
 9   genre_3            4686 non-null   object
 10  genre_4            1525 non-null   object
 11  genre_5            378 non-null    object
 12  genre_6            62 non-null     object
 13  genre_7            9 non-null      object
 14  genre_8            2 non-null      object
 15  genre_9            2 non-null      object
 16  genre_10           2 non-null      object
dtypes: float64(1), int64(2), object(14)
memory usage: 1.3+ MB

In [123]:
# converting release date to datetime
tmdb_df['release_date'] = pd.to_datetime(tmdb_df['release_date'])

In [124]:
# splitting date into year and month
tmdb_df['Year'] = tmdb_df['release_date'].dt.strftime('%Y')
tmdb_df['Month'] = tmdb_df['release_date'].dt.strftime('%m')
tmdb_df.drop(columns='release_date', inplace=True)

In [125]:
tmdb_df

,original_title,imdb_id,revenue,runtime,vote_average,original_language,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
0,Toy Story,tt0114709,373554033,81,7.965,en,Animation,Adventure,Family,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,1995,10
1,Jumanji,tt0113497,262821940,104,7.200,en,Adventure,Fantasy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
2,Grumpier Old Men,tt0113228,71500000,101,6.441,en,Romance,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
3,Waiting to Exhale,tt0114885,81452156,127,6.300,en,Comedy,Drama,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
4,Father of the Bride Part II,tt0113041,76594107,106,6.228,en,Comedy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9621,é»’åŸ·äº‹ Book of the Atlantic,tt5476944,0,100,7.653,ja,Animation,Action,Comedy,Fantasy,NaN,NaN,NaN,NaN,NaN,NaN,2017,01
9622,ãƒŽãƒ¼ã‚²ãƒ¼ãƒ ãƒ»ãƒŽãƒ¼ãƒ©ã‚¤ãƒ• ã‚¼ãƒ­,tt5914996,6000000,106,7.862,ja,Animation,Action,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,07
9623,Flint,tt6397426,0,96,7.000,en,TV Movie,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,10
9624,æ–‡è±ªã‚¹ãƒˆãƒ¬ã‚¤ãƒ‰ãƒƒã‚°ã‚¹ DEAD APPLE,tt8391976,0,90,8.200,ja,Animation,Action,Comedy,Mystery,Crime,Fantasy,NaN,NaN,NaN,NaN,2018,03
9625,Andrew Dice Clay: Dice Rules,tt0101726,0,85,6.500,en,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1991,05

In [127]:
# adjusting vote_average
tmdb_df['vote_average'] = tmdb_df['vote_average'] * 10

In [128]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_title     9626 non-null   object
 1   imdb_id            9626 non-null   object
 2   revenue            9626 non-null   int64
 3   runtime            9626 non-null   int64
 4   vote_average       9626 non-null   float64
 5   original_language  9626 non-null   object
 6   genre_1            9622 non-null   object
 7   genre_2            7923 non-null   object
 8   genre_3            4686 non-null   object
 9   genre_4            1525 non-null   object
 10  genre_5            378 non-null    object
 11  genre_6            62 non-null     object
 12  genre_7            9 non-null      object
 13  genre_8            2 non-null      object
 14  genre_9            2 non-null      object
 15  genre_10           2 non-null      object
 16  Year               9626 non-null   object
 17  Month              9626 non-null   object
dtypes: float64(1), int64(2), object(15)
memory usage: 1.4+ MB

In [129]:
# checking for & deleting duplicates
tmdb_df[tmdb_df.duplicated(keep=False)]

,original_title,imdb_id,revenue,runtime,vote_average,original_language,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
4160,Confessions of a Dangerous Mind,tt0270288,33013805,113,67.27,en,Comedy,Crime,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12
4161,Confessions of a Dangerous Mind,tt0270288,33013805,113,67.27,en,Comedy,Crime,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12

In [130]:
tmdb_df.drop_duplicates(keep='first',inplace=True)

In [131]:
tmdb_df[tmdb_df.duplicated(keep=False)]

Empty DataFrame
Columns: [original_title, imdb_id, revenue, runtime, vote_average, original_language, genre_1, genre_2, genre_3, genre_4, genre_5, genre_6, genre_7, genre_8, genre_9, genre_10, Year, Month]
Index: []

In [132]:
# there shouldn't be any null movie titles but double checking just in case
tmdb_df[tmdb_df['original_title'].isna()]

Empty DataFrame
Columns: [original_title, imdb_id, revenue, runtime, vote_average, original_language, genre_1, genre_2, genre_3, genre_4, genre_5, genre_6, genre_7, genre_8, genre_9, genre_10, Year, Month]
Index: []

In [133]:
# exporting cleaned dataframe
tmdb_df.to_csv('tmdb_df_cleaned.csv', index=False)

### OMDB Data

In [34]:
# Load dataset
omdb_df = pd.read_csv('../acquisition/omdb_raw_data.csv')

In [35]:
omdb_df.head()

,Title,Year,Rated,Released,Runtime,Genre,Director,Writer,Actors,Plot,...,Type,DVD,BoxOffice,Production,Website,Response,Season,Episode,seriesID,totalSeasons
0,Toy Story,1995,G,22 Nov 1995,81 min,"Animation, Adventure, Comedy",John Lasseter,"John Lasseter, Pete Docter, Andrew Stanton","Tom Hanks, Tim Allen, Don Rickles",A cowboy doll is profoundly threatened and jea...,...,movie,23 Mar 2010,"$223,225,679",NaN,NaN,True,NaN,NaN,NaN,NaN
1,Jumanji,1995,PG,15 Dec 1995,104 min,"Adventure, Comedy, Family",Joe Johnston,"Jonathan Hensleigh, Greg Taylor, Jim Strain","Robin Williams, Kirsten Dunst, Bonnie Hunt",When two kids find and play a magical board ga...,...,movie,NaN,"$100,499,940",NaN,NaN,True,NaN,NaN,NaN,NaN
2,Grumpier Old Men,1995,PG-13,22 Dec 1995,101 min,"Comedy, Romance",Howard Deutch,Mark Steven Johnson,"Walter Matthau, Jack Lemmon, Ann-Margret",John and Max resolve to save their beloved bai...,...,movie,15 May 2007,"$71,518,503",NaN,NaN,True,NaN,NaN,NaN,NaN
3,Waiting to Exhale,1995,R,22 Dec 1995,124 min,"Comedy, Drama, Romance",Forest Whitaker,"Terry McMillan, Ron Bass","Whitney Houston, Angela Bassett, Loretta Devine","Based on Terry McMillan's novel, this film fol...",...,movie,20 Jul 1999,"$67,052,156",NaN,NaN,True,NaN,NaN,NaN,NaN
4,Father of the Bride Part II,1995,PG,08 Dec 1995,106 min,"Comedy, Family, Romance",Charles Shyer,"Albert Hackett, Frances Goodrich, Nancy Meyers","Steve Martin, Diane Keaton, Martin Short",George Banks must deal not only with his daugh...,...,movie,25 Jan 2005,"$76,594,107",NaN,NaN,True,NaN,NaN,NaN,NaN

In [36]:
omdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9626 entries, 0 to 9625
Data columns (total 29 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         9626 non-null   object
 1   Year          9626 non-null   object
 2   Rated         9238 non-null   object
 3   Released      9576 non-null   object
 4   Runtime       9625 non-null   object
 5   Genre         9626 non-null   object
 6   Director      9613 non-null   object
 7   Writer        9454 non-null   object
 8   Actors        9608 non-null   object
 9   Plot          9622 non-null   object
 10  Language      9621 non-null   object
 11  Country       9420 non-null   object
 12  Awards        8017 non-null   object
 13  Poster        9624 non-null   object
 14  Ratings       9626 non-null   object
 15  Metascore     6867 non-null   float64
 16  imdbRating    9592 non-null   float64
 17  imdbVotes     9626 non-null   object
 18  imdbID        9626 non-null   object
 19  Type          9626 non-null   object
 20  DVD           8882 non-null   object
 21  BoxOffice     7005 non-null   object
 22  Production    57 non-null     object
 23  Website       0 non-null      float64
 24  Response      9626 non-null   bool
 25  Season        4 non-null      float64
 26  Episode       4 non-null      float64
 27  seriesID      4 non-null      object
 28  totalSeasons  9 non-null      float64
dtypes: bool(1), float64(6), object(22)
memory usage: 2.1+ MB

In [37]:
# dropping unnecessary columns
omdb_df.drop(columns=['Released','Runtime','Writer','Plot','Awards','Poster',
                      'imdbVotes','Type','DVD','Production','Website',
                      'Response','Season','Episode','seriesID','totalSeasons'], inplace=True)

In [38]:
omdb_df.head()

,Title,Year,Rated,Genre,Director,Actors,Language,Country,Ratings,Metascore,imdbRating,imdbID,BoxOffice
0,Toy Story,1995,G,"Animation, Adventure, Comedy",John Lasseter,"Tom Hanks, Tim Allen, Don Rickles",English,United States,"[{'Source': 'Internet Movie Database', 'Value'...",95.0,8.3,tt0114709,"$223,225,679"
1,Jumanji,1995,PG,"Adventure, Comedy, Family",Joe Johnston,"Robin Williams, Kirsten Dunst, Bonnie Hunt","English, French",United States,"[{'Source': 'Internet Movie Database', 'Value'...",39.0,7.0,tt0113497,"$100,499,940"
2,Grumpier Old Men,1995,PG-13,"Comedy, Romance",Howard Deutch,"Walter Matthau, Jack Lemmon, Ann-Margret","English, Italian, German",United States,"[{'Source': 'Internet Movie Database', 'Value'...",46.0,6.6,tt0113228,"$71,518,503"
3,Waiting to Exhale,1995,R,"Comedy, Drama, Romance",Forest Whitaker,"Whitney Houston, Angela Bassett, Loretta Devine",English,United States,"[{'Source': 'Internet Movie Database', 'Value'...",NaN,5.9,tt0114885,"$67,052,156"
4,Father of the Bride Part II,1995,PG,"Comedy, Family, Romance",Charles Shyer,"Steve Martin, Diane Keaton, Martin Short",English,United States,"[{'Source': 'Internet Movie Database', 'Value'...",49.0,6.0,tt0113041,"$76,594,107"

### Cleaning ratings

In [39]:
# want to get ratings data
omdb_df['Ratings'] = omdb_df['Ratings'].apply(literal_eval)

In [40]:
ratings_only = omdb_df.explode('Ratings')

In [41]:
# retrieving only ratings
ratings_only = ratings_only['Ratings'].apply(pd.Series)

In [42]:
ratings_only.head()

                    Source   Value   0
0  Internet Movie Database  8.3/10 NaN
0          Rotten Tomatoes    100% NaN
0               Metacritic  95/100 NaN
1  Internet Movie Database  7.0/10 NaN
1          Rotten Tomatoes     52% NaN

In [43]:
# merging with main df to get values for merging later
ratings_only = pd.merge(omdb_df, ratings_only, left_index=True, right_index=True)

In [44]:
ratings_only = ratings_only[['Title','imdbID','Source','Value']]

In [45]:
ratings_only.rename(columns={'Source':'Rating_Source','Value':'Rating_Value'}, inplace=True)

In [46]:
ratings_only.head()

       Title     imdbID            Rating_Source Rating_Value
0  Toy Story  tt0114709  Internet Movie Database       8.3/10
0  Toy Story  tt0114709          Rotten Tomatoes         100%
0  Toy Story  tt0114709               Metacritic       95/100
1    Jumanji  tt0113497  Internet Movie Database       7.0/10
1    Jumanji  tt0113497          Rotten Tomatoes          52%

In [47]:
ratings_only['IMDB_Value'] = 0
ratings_only['RT_Value'] = 0
ratings_only['MC_Value'] = 0

In [48]:
ratings_only

,Title,imdbID,Rating_Source,Rating_Value,IMDB_Value,RT_Value,MC_Value
0,Toy Story,tt0114709,Internet Movie Database,8.3/10,0,0,0
0,Toy Story,tt0114709,Rotten Tomatoes,100%,0,0,0
0,Toy Story,tt0114709,Metacritic,95/100,0,0,0
1,Jumanji,tt0113497,Internet Movie Database,7.0/10,0,0,0
1,Jumanji,tt0113497,Rotten Tomatoes,52%,0,0,0
...,...,...,...,...,...,...,...
9623,Flint,tt6397426,Internet Movie Database,6.2/10,0,0,0
9623,Flint,tt6397426,Rotten Tomatoes,57%,0,0,0
9624,Bungo Stray Dogs: Dead Apple,tt8391976,Internet Movie Database,7.3/10,0,0,0
9625,Dice Rules,tt0101726,Internet Movie Database,5.3/10,0,0,0
9625,Dice Rules,tt0101726,Rotten Tomatoes,7%,0,0,0

In [49]:
ratings_only.loc[ratings_only['Rating_Source'] == 'Internet Movie Database', 'IMDB_Value']

0       0
1       0
2       0
3       0
4       0
       ..
9621    0
9622    0
9623    0
9624    0
9625    0
Name: IMDB_Value, Length: 9592, dtype: int64

In [50]:
# assigning ratings based on their source
ratings_only['IMDB_Value'] = ratings_only[['Rating_Value']].loc[ratings_only['Rating_Source'] == 'Internet Movie Database']
ratings_only['RT_Value'] = ratings_only[['Rating_Value']].loc[ratings_only['Rating_Source'] == 'Rotten Tomatoes']
ratings_only['MC_Value'] = ratings_only[['Rating_Value']].loc[ratings_only['Rating_Source'] == 'Metacritic']

In [51]:
ratings_only.drop(columns=['Rating_Source','Rating_Value'], inplace=True)

In [52]:
ratings_only.drop_duplicates(keep='first',inplace=True)

In [53]:
ratings_only.head()

                         Title     imdbID IMDB_Value RT_Value MC_Value
0                    Toy Story  tt0114709     8.3/10     100%   95/100
1                      Jumanji  tt0113497     7.0/10      52%   39/100
2             Grumpier Old Men  tt0113228     6.6/10      17%   46/100
3            Waiting to Exhale  tt0114885     5.9/10      61%      NaN
4  Father of the Bride Part II  tt0113041     6.0/10      52%   49/100

In [54]:
# adjusting/scaling ratings

In [55]:
imdb_ratings = ratings_only['IMDB_Value'].str.split('/', expand=True)

In [56]:
imdb_ratings[0]

0       8.3
1       7.0
2       6.6
3       5.9
4       6.0
       ...
9621    7.6
9622    7.3
9623    6.2
9624    7.3
9625    5.3
Name: 0, Length: 9625, dtype: object

In [57]:
ratings_only['IMDB_Value'] = imdb_ratings[0].astype(float) * 10

In [58]:
ratings_only

,Title,imdbID,IMDB_Value,RT_Value,MC_Value
0,Toy Story,tt0114709,83.0,100%,95/100
1,Jumanji,tt0113497,70.0,52%,39/100
2,Grumpier Old Men,tt0113228,66.0,17%,46/100
3,Waiting to Exhale,tt0114885,59.0,61%,NaN
4,Father of the Bride Part II,tt0113041,60.0,52%,49/100
...,...,...,...,...,...
9621,Black Butler: Book of the Atlantic,tt5476944,76.0,NaN,NaN
9622,No Game No Life: Zero,tt5914996,73.0,NaN,NaN
9623,Flint,tt6397426,62.0,57%,NaN
9624,Bungo Stray Dogs: Dead Apple,tt8391976,73.0,NaN,NaN
9625,Dice Rules,tt0101726,53.0,7%,NaN

In [59]:
mc_ratings = ratings_only['MC_Value'].str.split('/', expand=True)
ratings_only['MC_Value'] = mc_ratings[0].astype(float)

In [60]:
rt_ratings = ratings_only['RT_Value'].str.split('%', expand=True)
ratings_only['RT_Value'] = rt_ratings[0].astype(float)

In [61]:
ratings_only.head()

                         Title     imdbID  IMDB_Value  RT_Value  MC_Value
0                    Toy Story  tt0114709        83.0     100.0      95.0
1                      Jumanji  tt0113497        70.0      52.0      39.0
2             Grumpier Old Men  tt0113228        66.0      17.0      46.0
3            Waiting to Exhale  tt0114885        59.0      61.0       NaN
4  Father of the Bride Part II  tt0113041        60.0      52.0      49.0

In [62]:
# merging into original df
omdb_df = pd.merge(omdb_df, ratings_only, left_on=['Title','imdbID'], right_on=['Title','imdbID'])

In [63]:
omdb_df.drop(columns=['Ratings','Metascore','imdbRating'], inplace=True)

In [64]:
omdb_df.head()

,Title,Year,Rated,Genre,Director,Actors,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value
0,Toy Story,1995,G,"Animation, Adventure, Comedy",John Lasseter,"Tom Hanks, Tim Allen, Don Rickles",English,United States,tt0114709,"$223,225,679",83.0,100.0,95.0
1,Jumanji,1995,PG,"Adventure, Comedy, Family",Joe Johnston,"Robin Williams, Kirsten Dunst, Bonnie Hunt","English, French",United States,tt0113497,"$100,499,940",70.0,52.0,39.0
2,Grumpier Old Men,1995,PG-13,"Comedy, Romance",Howard Deutch,"Walter Matthau, Jack Lemmon, Ann-Margret","English, Italian, German",United States,tt0113228,"$71,518,503",66.0,17.0,46.0
3,Waiting to Exhale,1995,R,"Comedy, Drama, Romance",Forest Whitaker,"Whitney Houston, Angela Bassett, Loretta Devine",English,United States,tt0114885,"$67,052,156",59.0,61.0,NaN
4,Father of the Bride Part II,1995,PG,"Comedy, Family, Romance",Charles Shyer,"Steve Martin, Diane Keaton, Martin Short",English,United States,tt0113041,"$76,594,107",60.0,52.0,49.0

### Cleaning actors

In [65]:
actors_df = omdb_df['Actors'].str.split(',', expand=True)

In [66]:
actors_df.head()

                 0                1                2     3
0        Tom Hanks        Tim Allen      Don Rickles  None
1   Robin Williams    Kirsten Dunst      Bonnie Hunt  None
2   Walter Matthau      Jack Lemmon      Ann-Margret  None
3  Whitney Houston   Angela Bassett   Loretta Devine  None
4     Steve Martin     Diane Keaton     Martin Short  None

In [67]:
actors_df.columns = ['Actor_{}'.format(x+1) for x in actors_df.columns]

In [68]:
actors_df.head()

           Actor_1          Actor_2          Actor_3 Actor_4
0        Tom Hanks        Tim Allen      Don Rickles    None
1   Robin Williams    Kirsten Dunst      Bonnie Hunt    None
2   Walter Matthau      Jack Lemmon      Ann-Margret    None
3  Whitney Houston   Angela Bassett   Loretta Devine    None
4     Steve Martin     Diane Keaton     Martin Short    None

In [69]:
omdb_df = pd.merge(omdb_df, actors_df, left_index=True, right_index=True)
omdb_df.drop(columns='Actors', inplace=True)
omdb_df.head()

,Title,Year,Rated,Genre,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,Actor_1,Actor_2,Actor_3,Actor_4
0,Toy Story,1995,G,"Animation, Adventure, Comedy",John Lasseter,English,United States,tt0114709,"$223,225,679",83.0,100.0,95.0,Tom Hanks,Tim Allen,Don Rickles,None
1,Jumanji,1995,PG,"Adventure, Comedy, Family",Joe Johnston,"English, French",United States,tt0113497,"$100,499,940",70.0,52.0,39.0,Robin Williams,Kirsten Dunst,Bonnie Hunt,None
2,Grumpier Old Men,1995,PG-13,"Comedy, Romance",Howard Deutch,"English, Italian, German",United States,tt0113228,"$71,518,503",66.0,17.0,46.0,Walter Matthau,Jack Lemmon,Ann-Margret,None
3,Waiting to Exhale,1995,R,"Comedy, Drama, Romance",Forest Whitaker,English,United States,tt0114885,"$67,052,156",59.0,61.0,NaN,Whitney Houston,Angela Bassett,Loretta Devine,None
4,Father of the Bride Part II,1995,PG,"Comedy, Family, Romance",Charles Shyer,English,United States,tt0113041,"$76,594,107",60.0,52.0,49.0,Steve Martin,Diane Keaton,Martin Short,None

In [70]:
# dropping genre as well since tmdb has better genre information
omdb_df.drop(columns='Genre', inplace=True)

### Cleaning languages, revenue & country

In [71]:
languages = omdb_df['Language'].str.split(',', expand=True)

In [72]:
languages.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,English,None,None,None,None,None,None,None,None,None,None,None,None,None,None
1,English,French,None,None,None,None,None,None,None,None,None,None,None,None,None
2,English,Italian,German,None,None,None,None,None,None,None,None,None,None,None,None
3,English,None,None,None,None,None,None,None,None,None,None,None,None,None,None
4,English,None,None,None,None,None,None,None,None,None,None,None,None,None,None

In [73]:
# setting language to be main (first) language
omdb_df['Language'] = languages[[0]]

In [74]:
# cleaning box office
revenue = omdb_df['BoxOffice'].str.split('$', expand=True)

In [75]:
revenue.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7005 non-null   object
 1   1       7005 non-null   object
dtypes: object(2)
memory usage: 483.6+ KB

In [76]:
revenue[[1]]

                1
0     223,225,679
1     100,499,940
2      71,518,503
3      67,052,156
4      76,594,107
...           ...
9621      248,286
9622          NaN
9623          NaN
9624          NaN
9625      637,327

[9626 rows x 1 columns]

In [77]:
revenue[1] = revenue[1].str.replace(',','').astype(float)

In [78]:
omdb_df['BoxOffice'] = revenue[1]

In [79]:
# cleaning country
country = omdb_df['Country'].str.split(',', expand=True)

In [80]:
country = country[[0]]

In [81]:
omdb_df['Country'] = country

In [138]:
omdb_df.drop(columns='Year', inplace=True)

In [140]:
# exporting cleaned dataframe
omdb_df.to_csv('omdb_df_cleaned.csv', index=False)

### Merging

In [141]:
tmdb_df.head()

,original_title,imdb_id,revenue,runtime,vote_average,original_language,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
0,Toy Story,tt0114709,373554033,81,79.65,en,Animation,Adventure,Family,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,1995,10
1,Jumanji,tt0113497,262821940,104,72.00,en,Adventure,Fantasy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
2,Grumpier Old Men,tt0113228,71500000,101,64.41,en,Romance,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
3,Waiting to Exhale,tt0114885,81452156,127,63.00,en,Comedy,Drama,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
4,Father of the Bride Part II,tt0113041,76594107,106,62.28,en,Comedy,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12

In [142]:
omdb_df.head()

,Title,Rated,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,Actor_1,Actor_2,Actor_3,Actor_4
0,Toy Story,G,John Lasseter,English,United States,tt0114709,223225679.0,83.0,100.0,95.0,Tom Hanks,Tim Allen,Don Rickles,None
1,Jumanji,PG,Joe Johnston,English,United States,tt0113497,100499940.0,70.0,52.0,39.0,Robin Williams,Kirsten Dunst,Bonnie Hunt,None
2,Grumpier Old Men,PG-13,Howard Deutch,English,United States,tt0113228,71518503.0,66.0,17.0,46.0,Walter Matthau,Jack Lemmon,Ann-Margret,None
3,Waiting to Exhale,R,Forest Whitaker,English,United States,tt0114885,67052156.0,59.0,61.0,NaN,Whitney Houston,Angela Bassett,Loretta Devine,None
4,Father of the Bride Part II,PG,Charles Shyer,English,United States,tt0113041,76594107.0,60.0,52.0,49.0,Steve Martin,Diane Keaton,Martin Short,None

In [155]:
final_df = pd.merge(omdb_df, tmdb_df,
                   how='outer',
                   left_on=['imdbID'],
                   right_on=['imdb_id'])

In [156]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 32 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Title              9626 non-null   object
 1   Rated              9238 non-null   object
 2   Director           9613 non-null   object
 3   Language           9621 non-null   object
 4   Country            9420 non-null   object
 5   imdbID             9626 non-null   object
 6   BoxOffice          7005 non-null   float64
 7   IMDB_Value         9592 non-null   float64
 8   RT_Value           8485 non-null   float64
 9   MC_Value           6867 non-null   float64
 10  Actor_1            9608 non-null   object
 11  Actor_2            9520 non-null   object
 12  Actor_3            9467 non-null   object
 13  Actor_4            155 non-null    object
 14  original_title     9626 non-null   object
 15  imdb_id            9626 non-null   object
 16  revenue            9626 non-null   int64
 17  runtime            9626 non-null   int64
 18  vote_average       9626 non-null   float64
 19  original_language  9626 non-null   object
 20  genre_1            9622 non-null   object
 21  genre_2            7923 non-null   object
 22  genre_3            4686 non-null   object
 23  genre_4            1525 non-null   object
 24  genre_5            378 non-null    object
 25  genre_6            62 non-null     object
 26  genre_7            9 non-null      object
 27  genre_8            2 non-null      object
 28  genre_9            2 non-null      object
 29  genre_10           2 non-null      object
 30  Year               9626 non-null   object
 31  Month              9626 non-null   object
dtypes: float64(5), int64(2), object(25)
memory usage: 2.4+ MB

In [157]:
final_df

,Title,Rated,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,...,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
0,Toy Story,G,John Lasseter,English,United States,tt0114709,223225679.0,83.0,100.0,95.0,...,Family,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,1995,10
1,Jumanji,PG,Joe Johnston,English,United States,tt0113497,100499940.0,70.0,52.0,39.0,...,Family,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
2,Grumpier Old Men,PG-13,Howard Deutch,English,United States,tt0113228,71518503.0,66.0,17.0,46.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
3,Waiting to Exhale,R,Forest Whitaker,English,United States,tt0114885,67052156.0,59.0,61.0,NaN,...,Romance,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
4,Father of the Bride Part II,PG,Charles Shyer,English,United States,tt0113041,76594107.0,60.0,52.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1995,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9621,Black Butler: Book of the Atlantic,TV-MA,"Noriyuki Abe, Stephen Hoff",Japanese,Japan,tt5476944,248286.0,76.0,NaN,NaN,...,Comedy,Fantasy,NaN,NaN,NaN,NaN,NaN,NaN,2017,01
9622,No Game No Life: Zero,TV-14,Atsuko Ishizuka,Japanese,Japan,tt5914996,NaN,73.0,NaN,NaN,...,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,07
9623,Flint,TV-14,Bruce Beresford,English,United States,tt6397426,NaN,62.0,57.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017,10
9624,Bungo Stray Dogs: Dead Apple,TV-14,Takuya Igarashi,Japanese,Japan,tt8391976,NaN,73.0,NaN,NaN,...,Comedy,Mystery,Crime,Fantasy,NaN,NaN,NaN,NaN,2018,03
9625,Dice Rules,NC-17,Jay Dubin,English,United States,tt0101726,637327.0,53.0,7.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1991,05

In [159]:
final_df[final_df['imdbID'].duplicated(keep=False)]

,Title,Rated,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,...,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
4160,Confessions of a Dangerous Mind,R,George Clooney,English,United States,tt0270288,16007718.0,70.0,79.0,67.0,...,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12
4161,Confessions of a Dangerous Mind,R,George Clooney,English,United States,tt0270288,16007718.0,70.0,79.0,67.0,...,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12

In [160]:
# checking for & deleting duplicates
final_df[final_df['imdbID'].duplicated(keep=False)]

,Title,Rated,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,...,genre_3,genre_4,genre_5,genre_6,genre_7,genre_8,genre_9,genre_10,Year,Month
4160,Confessions of a Dangerous Mind,R,George Clooney,English,United States,tt0270288,16007718.0,70.0,79.0,67.0,...,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12
4161,Confessions of a Dangerous Mind,R,George Clooney,English,United States,tt0270288,16007718.0,70.0,79.0,67.0,...,Drama,Romance,Thriller,Comedy,Crime,Drama,Romance,Thriller,2002,12

In [161]:
# dropping duplicates
final_df['imdbID'].drop_duplicates(keep='first',inplace=True)

In [163]:
# dropping nulls
final_df.dropna(subset=['imdbID', 'imdbID'], inplace=True)

In [164]:
final_df.drop(columns=
              ['original_title','revenue','original_language'], inplace=True)

In [165]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 29 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         9626 non-null   object
 1   Rated         9238 non-null   object
 2   Director      9613 non-null   object
 3   Language      9621 non-null   object
 4   Country       9420 non-null   object
 5   imdbID        9626 non-null   object
 6   BoxOffice     7005 non-null   float64
 7   IMDB_Value    9592 non-null   float64
 8   RT_Value      8485 non-null   float64
 9   MC_Value      6867 non-null   float64
 10  Actor_1       9608 non-null   object
 11  Actor_2       9520 non-null   object
 12  Actor_3       9467 non-null   object
 13  Actor_4       155 non-null    object
 14  imdb_id       9626 non-null   object
 15  runtime       9626 non-null   int64
 16  vote_average  9626 non-null   float64
 17  genre_1       9622 non-null   object
 18  genre_2       7923 non-null   object
 19  genre_3       4686 non-null   object
 20  genre_4       1525 non-null   object
 21  genre_5       378 non-null    object
 22  genre_6       62 non-null     object
 23  genre_7       9 non-null      object
 24  genre_8       2 non-null      object
 25  genre_9       2 non-null      object
 26  genre_10      2 non-null      object
 27  Year          9626 non-null   object
 28  Month         9626 non-null   object
dtypes: float64(5), int64(1), object(23)
memory usage: 2.2+ MB

In [166]:
final_df.drop(columns=
              ['genre_4', 'genre_5', 'genre_6', 'genre_7',
               'genre_8', 'genre_9', 'genre_10', 'Actor_4'], inplace=True)

In [167]:
final_df.head()

,Title,Rated,Director,Language,Country,imdbID,BoxOffice,IMDB_Value,RT_Value,MC_Value,...,Actor_2,Actor_3,imdb_id,runtime,vote_average,genre_1,genre_2,genre_3,Year,Month
0,Toy Story,G,John Lasseter,English,United States,tt0114709,223225679.0,83.0,100.0,95.0,...,Tim Allen,Don Rickles,tt0114709,81,79.65,Animation,Adventure,Family,1995,10
1,Jumanji,PG,Joe Johnston,English,United States,tt0113497,100499940.0,70.0,52.0,39.0,...,Kirsten Dunst,Bonnie Hunt,tt0113497,104,72.00,Adventure,Fantasy,Family,1995,12
2,Grumpier Old Men,PG-13,Howard Deutch,English,United States,tt0113228,71518503.0,66.0,17.0,46.0,...,Jack Lemmon,Ann-Margret,tt0113228,101,64.41,Romance,Comedy,NaN,1995,12
3,Waiting to Exhale,R,Forest Whitaker,English,United States,tt0114885,67052156.0,59.0,61.0,NaN,...,Angela Bassett,Loretta Devine,tt0114885,127,63.00,Comedy,Drama,Romance,1995,12
4,Father of the Bride Part II,PG,Charles Shyer,English,United States,tt0113041,76594107.0,60.0,52.0,49.0,...,Diane Keaton,Martin Short,tt0113041,106,62.28,Comedy,Family,NaN,1995,12

In [168]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 21 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         9626 non-null   object
 1   Rated         9238 non-null   object
 2   Director      9613 non-null   object
 3   Language      9621 non-null   object
 4   Country       9420 non-null   object
 5   imdbID        9626 non-null   object
 6   BoxOffice     7005 non-null   float64
 7   IMDB_Value    9592 non-null   float64
 8   RT_Value      8485 non-null   float64
 9   MC_Value      6867 non-null   float64
 10  Actor_1       9608 non-null   object
 11  Actor_2       9520 non-null   object
 12  Actor_3       9467 non-null   object
 13  imdb_id       9626 non-null   object
 14  runtime       9626 non-null   int64
 15  vote_average  9626 non-null   float64
 16  genre_1       9622 non-null   object
 17  genre_2       7923 non-null   object
 18  genre_3       4686 non-null   object
 19  Year          9626 non-null   object
 20  Month         9626 non-null   object
dtypes: float64(5), int64(1), object(15)
memory usage: 1.6+ MB

### Dealing with any leftover nulls

In [176]:
# Load dataset
t_df = pd.read_csv('../acquisition/tmdb_raw_data.csv')
o_df = pd.read_csv('../acquisition/omdb_raw_data.csv')

In [172]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 21 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         9626 non-null   object
 1   Rated         9238 non-null   object
 2   Director      9613 non-null   object
 3   Language      9621 non-null   object
 4   Country       9420 non-null   object
 5   imdbID        9626 non-null   object
 6   BoxOffice     7005 non-null   float64
 7   IMDB_Value    9626 non-null   float64
 8   RT_Value      9626 non-null   float64
 9   MC_Value      9626 non-null   float64
 10  Actor_1       9608 non-null   object
 11  Actor_2       9520 non-null   object
 12  Actor_3       9467 non-null   object
 13  imdb_id       9626 non-null   object
 14  runtime       9626 non-null   int64
 15  vote_average  9626 non-null   float64
 16  genre_1       9622 non-null   object
 17  genre_2       7923 non-null   object
 18  genre_3       4686 non-null   object
 19  Year          9626 non-null   object
 20  Month         9626 non-null   object
dtypes: float64(5), int64(1), object(15)
memory usage: 1.6+ MB

In [170]:
# replacing null rating values with the voted average
final_df['IMDB_Value'].fillna(final_df['vote_average'], inplace=True)
final_df['RT_Value'].fillna(final_df['vote_average'], inplace=True)
final_df['MC_Value'].fillna(final_df['vote_average'], inplace=True)

In [181]:
# replacing null box office data
final_df['BoxOffice'].fillna(t_df['revenue'], inplace=True)

In [182]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 21 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         9626 non-null   object
 1   Rated         9238 non-null   object
 2   Director      9613 non-null   object
 3   Language      9621 non-null   object
 4   Country       9420 non-null   object
 5   imdbID        9626 non-null   object
 6   BoxOffice     9626 non-null   float64
 7   IMDB_Value    9626 non-null   float64
 8   RT_Value      9626 non-null   float64
 9   MC_Value      9626 non-null   float64
 10  Actor_1       9608 non-null   object
 11  Actor_2       9520 non-null   object
 12  Actor_3       9467 non-null   object
 13  imdb_id       9626 non-null   object
 14  runtime       9626 non-null   int64
 15  vote_average  9626 non-null   float64
 16  genre_1       9622 non-null   object
 17  genre_2       7923 non-null   object
 18  genre_3       4686 non-null   object
 19  Year          9626 non-null   object
 20  Month         9626 non-null   object
dtypes: float64(5), int64(1), object(15)
memory usage: 1.6+ MB

In [187]:
# re-ordering dataframe
final_df = final_df[['imdbID', 'Title', 'Year', 'Month', 'BoxOffice',
          'IMDB_Value', 'RT_Value', 'MC_Value', 'vote_average',
          'Rated', 'Director', 'Language','Country', 'runtime',
         'Actor_1', 'Actor_2', 'Actor_3', 'genre_1', 'genre_2', 'genre_3']]

In [191]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 20 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   imdbID        9626 non-null   object
 1   Title         9626 non-null   object
 2   Year          9626 non-null   object
 3   Month         9626 non-null   object
 4   BoxOffice     9626 non-null   float64
 5   IMDB_Value    9626 non-null   float64
 6   RT_Value      9626 non-null   float64
 7   MC_Value      9626 non-null   float64
 8   vote_average  9626 non-null   float64
 9   Rated         9238 non-null   object
 10  Director      9613 non-null   object
 11  Language      9621 non-null   object
 12  Country       9420 non-null   object
 13  runtime       9626 non-null   int64
 14  Actor_1       9608 non-null   object
 15  Actor_2       9520 non-null   object
 16  Actor_3       9467 non-null   object
 17  genre_1       9622 non-null   object
 18  genre_2       7923 non-null   object
 19  genre_3       4686 non-null   object
dtypes: float64(5), int64(1), object(14)
memory usage: 1.5+ MB

In [194]:
final_df.rename(columns = {'BoxOffice':'Box_Office','vote_average':'Vote_Average', 
                           'genre_1':'Genre_1','genre_2':'Genre_2','genre_3':'Genre_3',
                          'runtime':'Runtime'}, inplace=True)

C:\Users\annie\AppData\Local\Temp\ipykernel_5052\116242988.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_df.rename(columns = {'BoxOffice':'Box_Office','vote_average':'Vote_Average',

In [195]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9626 entries, 0 to 9625
Data columns (total 20 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   imdbID        9626 non-null   object
 1   Title         9626 non-null   object
 2   Year          9626 non-null   object
 3   Month         9626 non-null   object
 4   Box_Office    9626 non-null   float64
 5   IMDB_Value    9626 non-null   float64
 6   RT_Value      9626 non-null   float64
 7   MC_Value      9626 non-null   float64
 8   Vote_Average  9626 non-null   float64
 9   Rated         9238 non-null   object
 10  Director      9613 non-null   object
 11  Language      9621 non-null   object
 12  Country       9420 non-null   object
 13  Runtime       9626 non-null   int64
 14  Actor_1       9608 non-null   object
 15  Actor_2       9520 non-null   object
 16  Actor_3       9467 non-null   object
 17  Genre_1       9622 non-null   object
 18  Genre_2       7923 non-null   object
 19  Genre_3       4686 non-null   object
dtypes: float64(5), int64(1), object(14)
memory usage: 1.5+ MB

In [196]:
# exporting cleaned dataframe
final_df.to_csv('cleaned_df.csv', index=False)